# Assignment Day 16-17 | Vaibhav Patel

In [70]:
import pandas as pd

In [3]:
title = pd.read_csv('/Users/VAIBHAV/Vaibhav/Python/LetUpgrade/LetsUpgradeAssignment/Day16-17/titles.csv')
title.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [4]:
print("Total number of movies listed are:",title.title.count())

Total number of movies listed are: 244914

### What are the earliest two films listed in the titles dataframe?

In [5]:
title.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [6]:
len(title[title.title == 'Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [7]:
len(title[title.title == 'North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [8]:
title[title.title == 'Hamlet'].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [9]:
title[title.title == 'Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [10]:
len(title[title.year == 1950])

1113

### How many movies were made in the year 1960?

In [11]:
len(title[title.year == 1960])

1549

### How many movies were made from 1950 through 1959?

In [12]:
len(title[(title.year >= 1950) & (title.year <= 1959)])

12934

### In what years has a movie titled "Batman" been released?

In [13]:
title[title.title == "Batman"]

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [14]:
cast = pd.read_csv('/Users/VAIBHAV/Vaibhav/Python/LetUpgrade/LetsUpgradeAssignment/Day16-17/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [15]:
print("Number of roles in movie Inception: ",len(cast[cast.title == "Inception"]))

Number of roles in movie Inception:  78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [16]:
print("Number of roles in the movie Inception are not ranked:",len(cast[(cast.title == "Inception") & (cast.n.isna())]))

Number of roles in the movie Inception are not ranked: 27

### But how many roles in the movie "Inception" did receive an "n" value?

In [17]:
print("Number of roles in the movie Inception did receive an n value:",len(cast[(cast.title == "Inception") & (cast.n.isna() == False)]))

Number of roles in the movie Inception did receive an n value: 51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:
df = cast[(cast.title == "North by Northwest") & (cast.n.isna() == False)]
df.sort_values(by=['n'])

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [19]:
df = cast[(cast.title == "Sleuth") & (cast.year == 1972) & (cast.n.isna() == False)]
df.sort_values(by=['n'])

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [20]:
df = cast[(cast.title == "Sleuth") & (cast.year == 2007) & (cast.n.isna() == False)]
df.sort_values(by=['n'])

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [31]:
print("Number of roles were created in the 1921 version of Hamlet:",len(cast[(cast.title == "Hamlet") & (cast.year == 1921)]))

Number of roles were created in the 1921 version of Hamlet: 9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [32]:
print("Number of roles were created in the 1996 Hamlet",len(cast[(cast.title == "Hamlet")  & (cast.year == 1996)]))

Number of roles were created in the 1996 Hamlet 54

### How many "Hamlet" roles have been listed in all film credits through history?

In [33]:
print("Number of roles have been listed Hamlet",len(cast[(cast.title == "Hamlet")]))

Number of roles have been listed Hamlet 342

### How many people have played an "Ophelia"?

In [35]:
print("Number of people played an Ophelia",len(cast[cast.title == "Ophelia"]))

Number of people played an Ophelia 20

### How many people have played a role called "The Dude"?

In [38]:
print("Number of people have played a role called The Dude:",len(cast[cast.character == "The Dude"]))

Number of people have played a role called The Dude: 19

### How many people have played a role called "The Stranger"?

In [41]:
print("Number of people have played a role called The Stranger:",len(cast[cast.character == "The Stranger"]))

Number of people have played a role called The Stranger: 212

### How many roles has Sidney Poitier played throughout his career?

In [42]:
print("Number of people have played a role called Sidney Poitier:",len(cast[cast.character == "Sidney Poitier"]))

Number of people have played a role called Sidney Poitier: 1

### How many roles has Judi Dench played?

In [46]:
print("Number of people have played a role called Judi Dench:",len(cast[cast.character == "Judi Dench"]))

Number of people have played a role called Judi Dench: 0

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [53]:
cast[(cast.character == "Cary Grant") & (cast.n == 2.0) & (cast.year == 1940)]

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [54]:
cast[(cast.character == "Cary Grant") & (cast.year == 1940)]

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### How many roles were available for actors in the 1950s?

In [58]:
print("Number of roles availabel for actors in the 1950s:",len(cast[(cast.year == 1950) & (cast.type == 'actor')]))

Number of roles availabel for actors in the 1950s: 16760

### How many roles were available for actresses in the 1950s?

In [59]:
print("Number of roles availabel for actresses in the 1950s:",len(cast[(cast.year == 1950) & (cast.type == 'actress')]))

Number of roles availabel for actresses in the 1950s: 5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [64]:
print("Number of leading roles were available from begining of film history through 1980:",len(cast[(cast.year >= 1980) & (cast.n == 1)]))

Number of leading roles were available from begining of film history through 1980: 89276

### How many non-leading roles were available through from the beginning of film history through 1980?

In [65]:
print("Number of non-leading roles were available from begining of film history through 1980:",len(cast[(cast.year >= 1980) & (cast.n != 1)]))

Number of non-leading roles were available from begining of film history through 1980: 2537565

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [68]:
print("Number of roles through 1980 were minor enough that they did not warrant a numeric n rank:",len(cast[(cast.year >= 1980) & (cast.n.isnull())]))

Number of roles through 1980 were minor enough that they did not warrant a numeric n rank: 1014692